/* NineAnimatorError DecodeError Message: This message is shown with the DecodeError error alert. The parameter inside the parenthesis is an identifier of the value that failed to be decoded. A DecodeError means that NineAnimator failed to deserialize or interpret a previously encoded data. */
"A required value (%@) cannot be read" = "يمكن قراءة القيمة المطلوبة (%@)";

/* NineAnimatorError DecodeError Message: This message is shown with the DecodeError error alert. A DecodeError means that NineAnimator failed to deserialize or interpret a previously encoded data. */
"A required value cannot be read" = "يمكن قراءة القيمة المطلوبة";

/* NineAnimatorError AuthenticationRequiredError Message: Representing an error which NineAnimator cannot continute until an authentication action is performed. */
"An authentication is required before NineAnimator can continue" = "مطلوب مصادقة من قبل ‎التطبيق ناين انيماتور يستطيع الاستمرار";

/* NineAnimatorError ProviderError Message: This error message is shown when NineAnimator failed to fetch a resource on a streaming server. */
"NineAnimator cannot fetch a resource on the streaming server" = "‎التطبيق ناين انيماتور لا يمكن جلب مورد على خادم البث";

/* NineAnimatorError ResponseError Message: This error message is shown when NineAnimator cannot understand a response sent by the server. */
"NineAnimator cannot understand a response sent by the server" = "‎التطبيق ناين انيماتور لا يمكن فهم الرد الذي أرسله الخادم";

/* NineAnimatorError AuthenticationRequiredError Recovery Option: This text is shown on the Open Link button of an alert that prompts the user to solve an CAPTCHA manually. */
"Open Link" = "فتح الرابط";

/* NineAnimatorError SearchError Message: A search error represents a non-fatal error thrown by the Source when searching. */
"Search Completed" = "اكتمل البحث";

/* NineAnimatorError LastItemInQueueError Message: This message is shown when the user has reached the last item in the list. */
"There are no more items in the selected list" = "لا يوجد المزيد من العناصر في القائمة المحددة";

/* NineAnimatorError URLError Message: This error message is shown when an URL is malformed, broken, or unexpected. */
"There is something wrong with the url" = "يوجد خطأ ما في عنوان URL";

/* NineAnimatorError ContentUnavailableError Message: This error is shown when the content that the user is requesting is no longer available. */
"This content is no longer available" = "هذا المحتوى غير متوفر";

/* NineAnimatorError EpisodeServerNotAvailableError Message: This error message is shown to the user when an episode selected is not available on the selected server. The parameter is the name of the server that is selected by the user. */
"This episode is not available on %@" = "هذه الحلقة غير متاحة على%@";

/* NineAnimatorError EpisodeServerNotAvailableError Message: This error message is shown to the user when an episode selected is not available on the selected server. */
"This episode is not available on the selected server" = "هذه الحلقة غير متوفرة على الخادم المحدد";

/* NineAnimatorError CloudflareAuthenticationChallenge Message: This message is shown when a website that uses Cloudflare is requesting additional WAF (Web Application Firewall) verifications. This can typically be handled internally by NineAnimator, but if NineAnimator failed to resolve the challenges this error message will be presented to the user. */
"this website asks NineAnimator to verify the identity of the user" = "يسأل هذا الموقع ‎التطبيق ناين انيماتور للتحقق من هوية المستخدم";

/* NineAnimatorError UnknownError Message: This error message is shown when an unknown error had occurred internally. */
"Unknown reason" = "سبب غير معلوم";

/* NineAnimatorError AuthenticationRequiredError Recovery Suggestion: This message is shown when an AuthenticationRequiredError happens to be resolvable manually (ex. a CAPTCHA request). */
"You may perform the authentication with the opening link, after which NineAnimator may re-attempt the request." = "يمكنك إجراء المصادقة باستخدام رابط الفتح ، وبعد ذلك ‎التطبيق ناين انيماتور.";
